Repository: dcarrero/password-es
Catalog: translations/messages.*.xlf
Languages: fr

source: Fork me on GitHub
fr: "Fork"-moi sur GitHub

source: Simple Password Generating App by %link%
fr: Un app facile pour générer des mots de passe par %link%

source: Language:
fr: Langue:

source: Toggle navigation
fr: Activer la navigation

source: About
fr: Information

source: Contact
fr: Contacte

source: Computer Password Generator
fr: Générateur de mot de passe ordinateur

source: Hybrid Password Generator
fr: Générateur de mot de passe hybride

source: Human Password Generator
fr: Générateur de mot de passe humain

source: Requirement Password Generator
fr: Générateur de mot de passe exigence

source: Makes complex passwords. The longer they are the harder they are to guess.
fr: Ce fonction fait des mots de passe complexes. Les plus longs les mots de passe, les plus difficiles à deviner ou craquer.

source: Similar to computer passwords, but they are split with dashes to help you remember them.
fr: Ce fonction fait des mots de passe presque pareils aux mots de passe ordinateurs, mais celuis-ci sont sépares par des tirets pour vous aider à les mémoriser.

source: Make passwords easier to remember and in theory harder to guess by using dictionary words. The more words you use the harder it'll be to guess.
fr: Ce fonction fait des mots de passe qui sont plus facile à mémoriser et plus difficile à deviner car il utilise les mots qu'on peut trouver dans une dictionnaire. Il est de plus en plus difficule à deviner, le plus mots que vous utilisez.

source: Makes complex passwords with minimum and maximum values. The longer they are the harder they are to guess.
fr: Ce fonction fait des mots de passe complexes avec des valeurs minimales et maximales. Les plus longs les mots de passe, les plus difficiles à deviner ou craquer.

source: This password generator was created after my favorite website for generating passwords was converted from GET to POST requests. This meant that the results page could no longer be bookmarked for quick password generation. This project also served to help reinforce the programming style of separations of concerns, which is why there is a library, bundle and app. Hopefully you'll get as much use out of this project as I have.
fr: Ce générateur de mot de passe a été créé après mon site favori pour générer des mots de passe a été convertie de GET à POST demandes. Cela signifie que la page de résultats ne pouvait plus être un signet pour la génération de mot de passe rapide. Ce projet a également servi pour aider à renforcer le style de programmation des séparations des intérêts, c'est pourquoi il y a un "Library" , un "Bundle" et un "App" . Je espère que vous allez obtenir autant l'utilisation de ce projet que moi.
